org/docs/8/extending-drupal-8/overview.org
#+TITLE: Overview
#+SETUPFILE: ../../../options/default.org

+ このページの原文: [[https://www.drupal.org/docs/8/extending-drupal-8/overview][Overview]]

* Overview
  [[https://www.drupal.org/node/2743413][Installing Drupal8]]を完了した今，[[https://www.drupal.org/node/1897420][Installing contributed modules]]により，あなたのサイトに機能性を追加できます．
  また，[[https://www.drupal.org/node/2804903][Installing contributed themes]]により，サイトの見た目とスタイルをカスタマイズできます．

  Drupalコアの標準インストールは機能性の面で制限されており，地味な見た目です．
  しかし，Drupalはモジュラー化されているため，追加のモジュール/テーマで容易に拡張できるように設計されています．

  Drupal.orgで利用可能な多数の追加モジュール/テーマのそれぞれは「プロジェクト(project)」と呼ばれ，それらはすべて無料です．
  それらは，あなたのようなDrupalコミュニティメンバーによって寄与されたため，しばしば「寄与(contrib)」と呼ばれます．

  多くの場合，あなたがまさに探しているものを提供するプロジェクトは，誰かによって既に書かれ，Drupal.orgへアップロードされているでしょう．

  使用するモジュールやテーマを見つける工程，およびそれをあなたのサイトにインポートする工程は，基本的にモジュールとテーマの両方において同じです．


** Modules
   モジュールは，サイトに機能性と「コアモジュール」を提供します．
   それらは標準インストールに含まれ，ほとんどのサイトで必要とされるすべての基本機能を提供します．

   ただし，一部のコアモジュールは，デフォルトでは有効になっていません(オンになっていません)．
   したがって，あなたのサイトの「拡張(Extend)」ページのモジュールリストを調べ，有効になっていないコアモジュールの一覧の中からあなたの探している機能があるかどうかを調べるといいでしょう．
   寄与モジュールの調査に時間を費やす前にね．

   [[https://www.drupal.org/node/1897420][Installing contributed modules]]というページは，全くの初心者向けの完全なガイドです．
   これは，寄与モジュールだけでなく，Drupalコアモジュールにも役立つ情報を含みます．


** Themes
   もし，あなたの基本的な興味が新しいテーマをインストールすることなら，[[https://www.drupal.org/node/1897420][Installing contributed modules]]をみるといいでしょう．
   モジュールであってもテーマであっても，プロジェクトの検索とインポートの詳細な手順が記載されています．
   現在，[[https://www.drupal.org/node/1897420][Installing contributed modules]]はあまり完成していない状態ですが，サイトにテーマをインポートした後も続行できます．


** 'Custom' projects
   コアモジュールやコアテーマを直接変更しないでください．
   なぜなら，毎月リリースされるDrupalのセキュリティ/バグフィックスのアップデートを適用する度にこれらの変更が上書きされるからです．
   これに対応するためには，あなたに必要なものを提供する寄与プロジェクトを見つけるか，あなた独自のカスタムプロジェクトを作成する必要があります．

   既存のプロジェクトのカスタマイズや独自のプロジェクトの作成に関するより高度な開発の情報については，以下を参照してください．
     + Modules: [[https://www.drupal.org/module-development][Module Development with Drupal]]
     + Themes:  [[https://www.drupal.org/theming][Theming and Front End Development with Drupal]]

	 
** Warning
   以前に使ったことのないモジュールを使う前にその動作を確認するため，あなたのサイトをバックアップして，それをテストしてください．
   特に，それが「他のリリース」や「開発リリース」のバージョンである場合は必ずテストしてください．
   なぜなら，それらのバージョンは，稼働中のWebサイトに適しているものとしてリリースされていないからです．

   これまでに使ったことのない寄与モジュールを使う前に，まずサイトをバックアップするべきです．
   特に，どのバージョンのDrupalコアがデータベースで使われていたかの記録をもつデータベースの場合は必ずです．

   また，批判的に言えば，あなたは毎回，実際のサイト（プロダクションサイトとも呼ばれます）ではなく，テストサイト（開発サイトとも呼ばれます）上で寄与モジュールをテストすべきです．
   これは，モジュールがあなたのサイトを破壊することに備えるためです．
