html/docs/8/extending-drupal-8/overview.html
<!DOCTYPE html>
<html lang="ja">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Overview</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="../../../pub/css/text.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<header>
<h1 class="title">Overview</h1>
</header><ul class="org-ul">
<li>このページの原文: <a href="https://www.drupal.org/docs/8/extending-drupal-8/overview">Overview</a></li>
</ul>

<div id="outline-container-org2108ce9" class="outline-2">
<h2 id="org2108ce9">Overview</h2>
<div class="outline-text-2" id="text-org2108ce9">
<p>
<a href="https://www.drupal.org/node/2743413">Installing Drupal8</a>を完了した今，<a href="https://www.drupal.org/node/1897420">Installing contributed modules</a>により，あなたのサイトに機能性を追加できます．
また，<a href="https://www.drupal.org/node/2804903">Installing contributed themes</a>により，サイトの見た目とスタイルをカスタマイズできます．
</p>

<p>
Drupalコアの標準インストールは機能性の面で制限されており，地味な見た目です．
しかし，Drupalはモジュラー化されているため，追加のモジュール/テーマで容易に拡張できるように設計されています．
</p>

<p>
Drupal.orgで利用可能な多数の追加モジュール/テーマのそれぞれは「プロジェクト(project)」と呼ばれ，それらはすべて無料です．
それらは，あなたのようなDrupalコミュニティメンバーによって寄与されたため，しばしば「寄与(contrib)」と呼ばれます．
</p>

<p>
多くの場合，あなたがまさに探しているものを提供するプロジェクトは，誰かによって既に書かれ，Drupal.orgへアップロードされているでしょう．
</p>

<p>
使用するモジュールやテーマを見つける工程，およびそれをあなたのサイトにインポートする工程は，基本的にモジュールとテーマの両方において同じです．
</p>
</div>


<div id="outline-container-org3c0da8f" class="outline-3">
<h3 id="org3c0da8f">Modules</h3>
<div class="outline-text-3" id="text-org3c0da8f">
<p>
モジュールは，サイトに機能性と「コアモジュール」を提供します．
それらは標準インストールに含まれ，ほとんどのサイトで必要とされるすべての基本機能を提供します．
</p>

<p>
ただし，一部のコアモジュールは，デフォルトでは有効になっていません(オンになっていません)．
したがって，あなたのサイトの「拡張(Extend)」ページのモジュールリストを調べ，有効になっていないコアモジュールの一覧の中からあなたの探している機能があるかどうかを調べるといいでしょう．
寄与モジュールの調査に時間を費やす前にね．
</p>

<p>
<a href="https://www.drupal.org/node/1897420">Installing contributed modules</a>というページは，全くの初心者向けの完全なガイドです．
これは，寄与モジュールだけでなく，Drupalコアモジュールにも役立つ情報を含みます．
</p>
</div>
</div>


<div id="outline-container-org3dec2db" class="outline-3">
<h3 id="org3dec2db">Themes</h3>
<div class="outline-text-3" id="text-org3dec2db">
<p>
もし，あなたの基本的な興味が新しいテーマをインストールすることなら，<a href="https://www.drupal.org/node/1897420">Installing contributed modules</a>をみるといいでしょう．
モジュールであってもテーマであっても，プロジェクトの検索とインポートの詳細な手順が記載されています．
現在，<a href="https://www.drupal.org/node/1897420">Installing contributed modules</a>はあまり完成していない状態ですが，サイトにテーマをインポートした後も続行できます．
</p>
</div>
</div>


<div id="outline-container-org06a95d4" class="outline-3">
<h3 id="org06a95d4">'Custom' projects</h3>
<div class="outline-text-3" id="text-org06a95d4">
<p>
コアモジュールやコアテーマを直接変更しないでください．
なぜなら，毎月リリースされるDrupalのセキュリティ/バグフィックスのアップデートを適用する度にこれらの変更が上書きされるからです．
これに対応するためには，あなたに必要なものを提供する寄与プロジェクトを見つけるか，あなた独自のカスタムプロジェクトを作成する必要があります．
</p>

<p>
既存のプロジェクトのカスタマイズや独自のプロジェクトの作成に関するより高度な開発の情報については，以下を参照してください．
</p>
<ul class="org-ul">
<li>Modules: <a href="https://www.drupal.org/module-development">Module Development with Drupal</a></li>
<li>Themes:  <a href="https://www.drupal.org/theming">Theming and Front End Development with Drupal</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgc8b0cdf" class="outline-3">
<h3 id="orgc8b0cdf">Warning</h3>
<div class="outline-text-3" id="text-orgc8b0cdf">
<p>
以前に使ったことのないモジュールを使う前にその動作を確認するため，あなたのサイトをバックアップして，それをテストしてください．
特に，それが「他のリリース」や「開発リリース」のバージョンである場合は必ずテストしてください．
なぜなら，それらのバージョンは，稼働中のWebサイトに適しているものとしてリリースされていないからです．
</p>

<p>
これまでに使ったことのない寄与モジュールを使う前に，まずサイトをバックアップするべきです．
特に，どのバージョンのDrupalコアがデータベースで使われていたかの記録をもつデータベースの場合は必ずです．
</p>

<p>
また，批判的に言えば，あなたは毎回，実際のサイト（プロダクションサイトとも呼ばれます）ではなく，テストサイト（開発サイトとも呼ばれます）上で寄与モジュールをテストすべきです．
これは，モジュールがあなたのサイトを破壊することに備えるためです．
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
